local T, C, L, G = unpack(select(2, ...))
if G.Client ~= "zhCN" then return end

L["UpdateLogs"] = {
[[11.20
团队框架Private Aura图标与点击施法冲突修正。
团队框架治疗边角提示完善。
增加团队框架点击施法鼠标标记。
]],

[[11.18
战团制造业专注值统计。
联盟暴富矿区传送按钮修正。
友方姓名板增加Cvar选项：友方只显示名字。
团队框架治疗边角提示完善。
团队框架点击施法法术选项完善。
Aurora更新。
其他错误修正。
]],

[[11.17
队伍查找器更新S2副本过滤按钮。
大秘境界面更新S2分数信息和传送按钮。
]],

[[11.16
队伍查找器增加副本过滤按钮。
自动购买商品时不买需要其他货币的商品。
图腾条显示鼠标提示。
主要声望监控错误修正。
角色节目查看声望时关闭装备列表。
团队框架在鼠标悬停时刷新血量。
团队框架奶骑、奶僧、增辉边角指示器更新。
团队框架添加一些点击施法的法术选项。
]],

[[11.15
恩护天赋黄金时间治疗量预估(需手动打开)。
恩护团队框架治疗指示器（数字/符号）完善。
控制台选项显示错误修正。
团队框架重叠错误修正。
]],

[[11.14
团队工具开怪倒计时按钮再次点击时可取消倒计时。
背包新物品未单独分类错误修正。
控制台添加更新日志页面。]],

[[11.13
团队框架点击施法和光环监控法术数据修正、清理过期法术。
大秘境界面外观调整，传送门按钮错位修正。
监测关键词自动邀请进组的报错修正。
自动接受好友邀请的报错修正。
聊天框中点击名字输入框不显示的错误修正。
单位框架离线血量显示错误修正。
玩家头像框架增加唤魔师精华显示。
施法条增加蓄力法术分段显示。
增加增益效果和负面效果显示时间的选项（控制台-其他）。
增加在头像上显示/隐藏玩家减益光环图标的选项（控制台-单位框架-光环）。]],
}