local T, C, L, G = unpack(select(2, ...))
if G.Client ~= "zhTW" then return end

L["UpdateLogs"] = {
[[11.18
戰團製造業專注值統計。
聯盟暴富礦區傳送按鈕修正。
友方姓名板新增Cvar選項：友方只顯示名字。
團隊框架治療邊角提示完善。
團隊框架點擊施法法術選項完善。
Aurora更新。
其他錯誤修正。
]],

[[11.17
隊伍查找器更新S2副本過濾按鈕。
大秘境介面更新S2分數資訊和傳送按鈕。
]],

[[11.16
隊伍查找器新增副本過濾按鈕。
自動購買商品時不買需要其他貨幣的商品。
圖騰條顯示滑鼠提示。
主要聲望監控錯誤修正。
角色節目查看聲望時關閉裝備清單。
團隊框架在滑鼠懸停時重繪血量。
團隊框架奶騎、奶僧、增輝邊角指示器更新。
團隊框架添加一些點擊施法的法術選項。
]],

[[11.15
恩護天賦黃金時間治療量預估（需手動打開）。
恩護團隊框架治療指示器（數位/符號）完善。
控制台選項顯示錯誤修正。
團隊框架重疊錯誤修正。
]],

[[11.14
團隊工具開怪倒數計時按鈕再次點擊時可取消倒數計時。
背包新物品未單獨分類錯誤修正。
控制台添加更新日誌頁面。]],

[[11.13
團隊框架點擊施法和光環監控法術數據修正、清理過期法術。
大秘境介面外觀調整，傳送門按鈕錯位修正。
監測關鍵字自動邀請進組的報錯修正。
自動接受好友邀請的報錯修正。
聊天框中點擊名字輸入框不顯示的錯誤修正。
單位框體離線血量顯示錯誤修正。
玩家頭像框架新增喚魔師精華顯示。
施法條新增蓄力法術分段顯示。
新增增益效果和負面效果顯示時間的選項（控制台-其他）。
新增在頭像上顯示/隱藏玩家减益光環圖標的選項（控制台-單位框體-光環）。]],
}